name: "alexnet_struct_umd_face_224x224_rgb"

# Use AlexNet to predict the shape (19 landmarks)
# The net will be updated
######### Shape Prediction Network #########
layer {
  name: "lmdb_data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  data_param {
    source: "./experiments/data_processing/dataset/train/umd_face_224x224_rgb_data"
    batch_size: 64
    backend: LMDB
  }
  transform_param {
    mean_file: "./experiments/data_processing/dataset/train/umd_face_224x224_rgb_mean.binaryproto"
  }
}
layer {
  name: "lmdb_label"
  type: "Data"
  top: "landmark"
  include {
    phase: TRAIN
  }
  data_param {
    source: "./experiments/data_processing/dataset/train/umd_face_224x224_rgb_landmark"
    batch_size: 64
    backend: LMDB
  }
}

layer {
  name: "lmdb_data"
  type: "Data"
  top: "data"
  include {
    phase: TEST
  }
  data_param {
    source: "./experiments/data_processing/dataset/test/umd_face_224x224_rgb_data"
    batch_size: 64
    backend: LMDB
  }
  transform_param {
    mean_file: "./experiments/data_processing/dataset/train/umd_face_224x224_rgb_mean.binaryproto"
  }
}

layer {
  name: "lmdb_label"
  type: "Data"
  top: "landmark"
  include {
    phase: TEST
  }
  data_param {
    source: "./experiments/data_processing/dataset/test/umd_face_224x224_rgb_landmark"
    batch_size: 64
    backend: LMDB
  }
}

layer {
  name: "lmdb_eyedist"
  type: "Data"
  top: "eyedist"
  include {
    phase: TEST
  }
  data_param {
    source: "./experiments/data_processing/dataset/test/umd_face_224x224_rgb_eyedist"
    batch_size: 64
    backend: LMDB
  }
}

# network architecture
layer {
  name: "lm_conv1"
  type: "Convolution"
  bottom: "data"
  top: "lm_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "lm_relu1"
  type: "ReLU"
  bottom: "lm_conv1"
  top: "lm_conv1"
}
layer {
  name: "lm_norm1"
  type: "LRN"
  bottom: "lm_conv1"
  top: "lm_norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "lm_pool1"
  type: "Pooling"
  bottom: "lm_norm1"
  top: "lm_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "lm_conv2"
  type: "Convolution"
  bottom: "lm_pool1"
  top: "lm_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "lm_relu2"
  type: "ReLU"
  bottom: "lm_conv2"
  top: "lm_conv2"
}
layer {
  name: "lm_norm2"
  type: "LRN"
  bottom: "lm_conv2"
  top: "lm_norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "lm_pool2"
  type: "Pooling"
  bottom: "lm_norm2"
  top: "lm_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "lm_conv3"
  type: "Convolution"
  bottom: "lm_pool2"
  top: "lm_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "lm_relu3"
  type: "ReLU"
  bottom: "lm_conv3"
  top: "lm_conv3"
}
layer {
  name: "lm_conv4"
  type: "Convolution"
  bottom: "lm_conv3"
  top: "lm_conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "lm_relu4"
  type: "ReLU"
  bottom: "lm_conv4"
  top: "lm_conv4"
}
layer {
  name: "lm_conv5"
  type: "Convolution"
  bottom: "lm_conv4"
  top: "lm_conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "lm_relu5"
  type: "ReLU"
  bottom: "lm_conv5"
  top: "lm_conv5"
}
layer {
  name: "lm_pool5"
  type: "Pooling"
  bottom: "lm_conv5"
  top: "lm_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "lm_fc6"
  type: "InnerProduct"
  bottom: "lm_pool5"
  top: "lm_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "lm_relu6"
  type: "ReLU"
  bottom: "lm_fc6"
  top: "lm_fc6"
}
layer {
  name: "lm_drop6"
  type: "Dropout"
  bottom: "lm_fc6"
  top: "lm_fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "lm_fc7"
  type: "InnerProduct"
  bottom: "lm_fc6"
  top: "lm_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "lm_relu7"
  type: "ReLU"
  bottom: "lm_fc7"
  top: "lm_fc7"
}
layer {
  name: "lm_drop7"
  type: "Dropout"
  bottom: "lm_fc7"
  top: "lm_fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "lm_fc8"
  type: "InnerProduct"
  bottom: "lm_fc7"
  top: "lm_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    # 19 points + 6 part roots
    num_output: 50
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

##### for computation of structural loss 
layer{
   name: "lm_slice_pre"
   type: "Slice"
   bottom: "lm_fc8"
   top:  "pre_landmark_LeftBrow"
   top:  "pre_landmark_RightBrow"
   top:  "pre_landmark_LeftEye"
   top:  "pre_landmark_RightEye"
   top:  "pre_landmark_Nose"
   top:  "pre_landmark_Mouth"
   top:  "pre_landmark_Chin"
   slice_param{
     axis: 1
     slice_point: 8
     slice_point: 16
     slice_point: 24
     slice_point: 32
     slice_point: 40
     slice_point: 48
   }
}

layer{
  name: "silence_chin"
  type: "Silence"
  bottom: "pre_landmark_Chin"
  include {
    phase: TRAIN
  }
}

layer{
   name: "lm_slice_gt"
   type: "Slice"
   bottom: "landmark"
   top:  "gt_landmark_LeftBrow"
   top:  "gt_landmark_RightBrow"
   top:  "gt_landmark_LeftEye"
   top:  "gt_landmark_RightEye"
   top:  "gt_landmark_Nose"
   top:  "gt_landmark_Mouth"
   top:  "gt_landmark_Chin"
   slice_param{
     axis: 1
     slice_point: 6
     slice_point: 12
     slice_point: 18
     slice_point: 24
     slice_point: 30
     slice_point: 36
   }

}
###Left Brow Part
layer {
  name: "averagepoint_LeftBrow"
  type: "AveragePoint"
  bottom: "gt_landmark_LeftBrow"
  top:    "gt_landmark_LeftBrow_root"
  average_point_param{
    num_landmark: 3
  }
}

layer{
   name: "concat_LeftBrow"
   type: "Concat"
   bottom: "gt_landmark_LeftBrow"
   bottom: "gt_landmark_LeftBrow_root"
   top:  "gt_landmark_LeftBrow_part"
   concat_param{
     axis: 1
   }
}

layer {
  name: "structual_loss_LeftBrow"
  type: "StructualLoss"
  bottom: "pre_landmark_LeftBrow"
  bottom: "gt_landmark_LeftBrow_part"
  top: "structual_loss_LeftBrow"
  structual_loss_param { 
    num_landmark: 3
    w0: 1.0
    w1: 0.5
    w2: 1.0
    w3: 0.5
  }
}

###Right Brow Part
layer {
  name: "averagepoint_RightBrow"
  type: "AveragePoint"
  bottom: "gt_landmark_RightBrow"
  top:    "gt_landmark_RightBrow_root"
  average_point_param{
    num_landmark: 3
  }
}

layer{
   name: "concat_RightBrow"
   type: "Concat"
   bottom: "gt_landmark_RightBrow"
   bottom: "gt_landmark_RightBrow_root"
   top:  "gt_landmark_RightBrow_part"
   concat_param{
     axis: 1
   }
}

layer {
  name: "structual_loss_RightBrow"
  type: "StructualLoss"
  bottom: "pre_landmark_RightBrow"
  bottom: "gt_landmark_RightBrow_part"
  top: "structual_loss_RightBrow"
  structual_loss_param { 
    num_landmark: 3
    w0: 1.0
    w1: 0.5
    w2: 1.0
    w3: 0.5
  }
}

###Left Eye Part
layer {
  name: "averagepoint_LeftEye"
  type: "AveragePoint"
  bottom: "gt_landmark_LeftEye"
  top:    "gt_landmark_LeftEye_root"
  average_point_param{
    num_landmark: 3
  }
}

layer{
   name: "concat_LeftEye"
   type: "Concat"
   bottom: "gt_landmark_LeftEye"
   bottom: "gt_landmark_LeftEye_root"
   top:  "gt_landmark_LeftEye_part"
   concat_param{
     axis: 1
   }
}

layer {
  name: "structual_loss_LeftEye"
  type: "StructualLoss"
  bottom: "pre_landmark_LeftEye"
  bottom: "gt_landmark_LeftEye_part"
  top: "structual_loss_LeftEye"
  structual_loss_param { 
    num_landmark: 3
    w0: 1.0
    w1: 0.5
    w2: 1.0
    w3: 0.5
  }
}

###Right Eye Part
layer {
  name: "averagepoint_RightEye"
  type: "AveragePoint"
  bottom: "gt_landmark_RightEye"
  top:    "gt_landmark_RightEye_root"
  average_point_param{
    num_landmark: 3
  }
}

layer{
   name: "concat_RightEye"
   type: "Concat"
   bottom: "gt_landmark_RightEye"
   bottom: "gt_landmark_RightEye_root"
   top:  "gt_landmark_RightEye_part"
   concat_param{
     axis: 1
   }
}

layer {
  name: "structual_loss_RightEye"
  type: "StructualLoss"
  bottom: "pre_landmark_RightEye"
  bottom: "gt_landmark_RightEye_part"
  top: "structual_loss_RightEye"
  structual_loss_param { 
    num_landmark: 3
    w0: 1.0
    w1: 0.5
    w2: 1.0
    w3: 0.5
  }
}

###Nose Part
layer {
  name: "averagepoint_Nose"
  type: "AveragePoint"
  bottom: "gt_landmark_Nose"
  top:    "gt_landmark_Nose_root"
  average_point_param{
    num_landmark: 3
  }
}

layer{
   name: "concat_Nose"
   type: "Concat"
   bottom: "gt_landmark_Nose"
   bottom: "gt_landmark_Nose_root"
   top:  "gt_landmark_Nose_part"
   concat_param{
     axis: 1
   }
}

layer {
  name: "structual_loss_Nose"
  type: "StructualLoss"
  bottom: "pre_landmark_Nose"
  bottom: "gt_landmark_Nose_part"
  top: "structual_loss_Nose"
  structual_loss_param { 
    num_landmark: 3
    w0: 1.0
    w1: 0.5
    w2: 1.0
    w3: 0.5
  }
}

###Mouth Part
layer {
  name: "averagepoint_Mouth"
  type: "AveragePoint"
  bottom: "gt_landmark_Mouth"
  top:    "gt_landmark_Mouth_root"
  average_point_param{
    num_landmark: 3
  }
}

layer{
   name: "concat_Mouth"
   type: "Concat"
   bottom: "gt_landmark_Mouth"
   bottom: "gt_landmark_Mouth_root"
   top:  "gt_landmark_Mouth_part"
   concat_param{
     axis: 1
   }
}

layer {
  name: "structual_loss_Mouth"
  type: "StructualLoss"
  bottom: "pre_landmark_Mouth"
  bottom: "gt_landmark_Mouth_part"
  top: "structual_loss_Mouth"
  structual_loss_param { 
    num_landmark: 3
    w0: 1.0
    w1: 0.5
    w2: 1.0
    w3: 0.5
  }
}

###Euclidean loss
layer{
   name: "concat_gt"
   type: "Concat"
   bottom: "gt_landmark_LeftBrow_part"
   bottom: "gt_landmark_RightBrow_part"
   bottom: "gt_landmark_LeftEye_part"
   bottom: "gt_landmark_RightEye_part"
   bottom: "gt_landmark_Nose_part"
   bottom: "gt_landmark_Mouth_part"
   bottom: "gt_landmark_Chin"
   top:  "gt_landmark"
   concat_param{
     axis: 1
   }
}


layer {
  name: "euclidean_loss"
  type: "EuclideanLoss"
  bottom: "lm_fc8"
  bottom: "gt_landmark"
  top: "euclidean_loss"
  loss_weight: 10
}

#####Performance
layer{
   name: "lm_slice_pre_LeftBrow"
   type: "Slice"
   bottom: "pre_landmark_LeftBrow"
   top:  "pre_landmark_LeftBrow_Point"
   top:  "pre_landmark_LeftBrow_root"
   slice_param{
     axis: 1
     slice_point: 6
   }
   include {
    phase: TEST
  }
}

layer {
  name: "silence_LeftBrow"
  type: "Silence"
  bottom: "pre_landmark_LeftBrow_root"
  include {
    phase: TEST
  }
}

layer{
   name: "lm_slice_pre_RightBrow"
   type: "Slice"
   bottom: "pre_landmark_RightBrow"
   top:  "pre_landmark_RightBrow_Point"
   top:  "pre_landmark_RightBrow_root"
   slice_param{
     axis: 1
     slice_point: 6
   }
   include {
    phase: TEST
  }
}
layer {
  name: "silence_RightBrow"
  type: "Silence"
  bottom: "pre_landmark_RightBrow_root"
  include {
    phase: TEST
  }
}

layer{
   name: "lm_slice_pre_LeftEye"
   type: "Slice"
   bottom: "pre_landmark_LeftEye"
   top:  "pre_landmark_LeftEye_Point"
   top:  "pre_landmark_LeftEye_root"
   slice_param{
     axis: 1
     slice_point: 6
   }
   include {
    phase: TEST
  }

}
layer {
  name: "silence_LeftEye"
  type: "Silence"
  bottom: "pre_landmark_LeftEye_root"
  include {
    phase: TEST
  }
}


layer{
   name: "lm_slice_pre_RightEye"
   type: "Slice"
   bottom: "pre_landmark_RightEye"
   top:  "pre_landmark_RightEye_Point"
   top:  "pre_landmark_RightEye_root"
   slice_param{
     axis: 1
     slice_point: 6
   }
   include {
    phase: TEST
  }
}
layer {
  name: "silence_RightEye"
  type: "Silence"
  bottom: "pre_landmark_RightEye_root"
  include {
    phase: TEST
  }
}

layer{
   name: "lm_slice_pre_Nose"
   type: "Slice"
   bottom: "pre_landmark_Nose"
   top:  "pre_landmark_Nose_Point"
   top:  "pre_landmark_Nose_root"
   slice_param{
     axis: 1
     slice_point: 6
   }
   include {
    phase: TEST
  }
}
layer {
  name: "silence_Nose"
  type: "Silence"
  bottom: "pre_landmark_Nose_root"
  include {
    phase: TEST
  }
}

layer{
   name: "lm_slice_pre_Mouth"
   type: "Slice"
   bottom: "pre_landmark_Mouth"
   top:  "pre_landmark_Mouth_Point"
   top:  "pre_landmark_Mouth_root"
   slice_param{
     axis: 1
     slice_point: 6
   }
   include {
    phase: TEST
  }
}
layer {
  name: "silence_Mouth"
  type: "Silence"
  bottom: "pre_landmark_Mouth_root"
  include {
    phase: TEST
  }
}

layer{
   name: "concat_pre"
   type: "Concat"
   bottom: "pre_landmark_LeftBrow_Point"
   bottom: "pre_landmark_RightBrow_Point"
   bottom: "pre_landmark_LeftEye_Point"
   bottom: "pre_landmark_RightEye_Point"
   bottom: "pre_landmark_Nose_Point"
   bottom: "pre_landmark_Mouth_Point"
   bottom: "pre_landmark_Chin"
   top:  "lm_19_points"
   include {
     phase: TEST
   }
   concat_param{
     axis: 1
   }
}
 
layer {
  name: "performance"
  type: "FacialLandmarkPerformance"
  bottom: "lm_19_points"
  bottom: "landmark"
  bottom: "eyedist"
  top: "average_error"
  top: "false_rate"
  
  facial_landmark_performance_param {
    num_landmark: 19
    error_threshold: 0.05
  }
  include {
    phase: TEST
  }
}



